# **Pandas Basics**

### **Install pandas package**

In [3]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

### **Import pandas**

In [4]:
import pandas as pd

## **DataFrames**
A DataFrame is a two-dimensional labeled data structure with columns of potentially 
different data types, similar to a spreadsheet or SQL table. 
It provides a powerful and flexible way to manipulate and analyze structured data in Python, 
offering functionalities for data analysis.

In [5]:
# Creating an Empty DataFrame
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [6]:
# Create a DataFrame using a list of lists
row_data = [["Jethro", 18], ["Isaac", 19], ["Arlon", 20]]
df = pd.DataFrame(row_data, columns=['Name', 'Age'])
df

     Name  Age
0  Jethro   18
1   Isaac   19
2   Arlon   20

In [7]:
# Creating a DataFrame using a dictionary of list
data = {
    'Name': ["Jethro", "Isaac", "Arlon"],
    'Age': [18, 19, 20]
}
df = pd.DataFrame(data)
df

     Name  Age
0  Jethro   18
1   Isaac   19
2   Arlon   20

In [8]:
# Creating a DataFrame by using a list of dictionaries.
data = [
    {'name': "Jethro", 'age': 18},
    {'name': "Isaac", 'age': 19},
    {'name': "Arlon", 'age': 20},
]
df = pd.DataFrame(data)
df

     name  age
0  Jethro   18
1   Isaac   19
2   Arlon   20

## **Series**

A pandas Series is a one-dimensional labeled array capable of 
holding data of any type (integer, string, float, etc.). 
It's similar to a one-column table or an array with associated labels, 
providing powerful indexing and manipulation capabilities in Python.

In [9]:
series = pd.Series([1, 2, 3, 4, 5])
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

### **Pandas Data Types**

Numeric:
- Integer (int64): Represents whole numbers (e.g., 10, -5). 
    This is the default integer type in pandas. (64 bit integer)
- Float (float64): Represents numbers with decimals (e.g., 3.14, -12.5).
- Boolean (bool): Represents logical True or False values.
- Object: This is a versatile but less efficient type that can store various data types 
like strings, lists, or custom objects. 
    Pandas uses this type when it cannot infer a more specific data type.

In [10]:
# Integer (int64)
int_series = pd.Series([1, 2, 3, 4, 5])
int_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
# Float (float64)
float_series = pd.Series([3.14, -3.14, 0.0001, -0.0001])
float_series

0    3.1400
1   -3.1400
2    0.0001
3   -0.0001
dtype: float64

In [12]:
# Boolean: True = 1 False = 0
boolean_series = pd.Series([True, False, True, False])
boolean_series

0     True
1    False
2     True
3    False
dtype: bool

In [13]:
# Objects =  (Mixed Data Types)
object_series = pd.Series([30, 3.14, True])
object_series

0      30
1    3.14
2    True
dtype: object

Specialized Data Types:
- Datetime (datetime64[ns]): Represents dates and times with nanosecond precision. 
    Useful for time-series data analysis.
- Timedelta (timedelta64[ns]): Represents durations between timestamps.
- Categorical: Represents categorical data with predefined categories. 
    Efficient for storing limited sets of categories.
- Sparse: Represents sparse data with many missing values. 
    Stores data efficiently by only keeping non-zero values.

In [14]:
date_time_series = pd.Series([pd.to_datetime("2024-04-05"), 
                              pd.to_datetime("2024-04-06"),
                              pd.to_datetime("2024-04-07")])
date_time_series

0   2024-04-05
1   2024-04-06
2   2024-04-07
dtype: datetime64[ns]

In [15]:
# Timedelta
timedelta_series = pd.Series([pd.Timedelta(days=8, hours=3, minutes=30), 
                              pd.Timedelta(days=4, hours=3, minutes=30), 
                              pd.Timedelta(days=1, hours=3, minutes=30)])
timedelta_series

0   8 days 03:30:00
1   4 days 03:30:00
2   1 days 03:30:00
dtype: timedelta64[ns]

In [16]:
categorical_series = pd.Series(pd.Categorical(["Sales", "Marketing", "Operations"]))
categorical_series

0         Sales
1     Marketing
2    Operations
dtype: category
Categories (3, object): ['Marketing', 'Operations', 'Sales']

In [17]:
# Sparse - missing/null values inside of the series
# NA = Null NaN = Not a number
sparse_series = pd.Series(pd.arrays.SparseArray([1, 2, pd.NA, 3, pd.NA, 5]))
sparse_series

0      1
1      2
2    NaN
3      3
4    NaN
5      5
dtype: Sparse[object, nan]

### **Changing Data Types**

In [18]:
int_series.dtype

dtype('int64')

In [19]:
# Convert the integer to float
float_series = int_series.astype('float64')
float_series

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [20]:
# Converting a float series to string
string_series = float_series.astype('string')
string_series

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: string

In [21]:
converted_to_float = string_series.astype('float64')
converted_to_float

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

**Example: Sales Data Analysis**

You have a dataset of sales transactions that includes the product name, quantity sold, and sale price. 
You want to analyze the data to find the total revenue per product.

In [22]:
data = {
    'Product Name':['A','B','C','A','B','A'],
    'Quantity Sold':[3,2,5,4,1,2],
    'Sale Price':[10,20,10,15,20,15]
}

sales_df = pd.DataFrame(data)
sales_df

  Product Name  Quantity Sold  Sale Price
0            A              3          10
1            B              2          20
2            C              5          10
3            A              4          15
4            B              1          20
5            A              2          15

In [23]:
sales_df['Total Revenue'] = sales_df['Quantity Sold'] * sales_df['Sale Price']
sales_df

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60
4            B              1          20             20
5            A              2          15             30

In [24]:
print(sum)(sales_df)['Total Revenue']

<built-in function sum>

TypeError: 'NoneType' object is not callable

In [ ]:
total_revenue = sales_df.groupby('Product Name')['Total Revenue'].sum()
total_revenue

Product Name
A    120
B     60
C     50
Name: Total Revenue, dtype: int64

In [ ]:
result_df = pd.DataFrame()
result_df['Total Revenue'] = sales_df.groupby('Product Name')['Total Revenue'].sum()
result_df

              Total Revenue
Product Name
A                       120
B                        60
C                        50

### **Data Selection**

Pandas provides numerous methods for selecting and indexing data in Series and DataFrames, 
including label-based indexing with .loc, integer-position based indexing with .iloc, and conditional selection.

In [25]:
sales_df

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60
4            B              1          20             20
5            A              2          15             30

### **Data Selection in Series**

In [26]:
# [starting_index:ending_index(excluded):step/traversal method]

# Getting the first two rows
sales_df['Product Name'][0:2]

0    A
1    B
Name: Product Name, dtype: object

In [27]:
# Getting custom rows
sales_df['Product Name'][1:4]

1    B
2    C
3    A
Name: Product Name, dtype: object

In [28]:
# Check in twos
sales_df['Product Name'][::2]

0    A
2    C
4    B
Name: Product Name, dtype: object

In [29]:
# Sum of the first two rows in Quantity Sold Column
sales_df['Quantity Sold'][0:2].sum()

np.int64(5)

In [30]:
# Sum of the first two rows in Quantity Sold Column
print("Sum:", sales_df['Quantity Sold'][0:2].sum())

Sum: 5

### **Data Selection in DataFrame**

#### **Index Location (.iloc)**
- Will get rows based on a number/index.
- Will output into a DataFrame instead of a Series.
> Syntax: [starting_index:ending_index(excluded):step/traversal method]

In [31]:
sales_df

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60
4            B              1          20             20
5            A              2          15             30

In [32]:
# [starting_index:ending_index(excluded):step/traversal method]
# Getting the first three rows of the DataFrame
sales_df.iloc[0:3]

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50

#### **Location (.loc)**
- Access a group of rows and columns by label(s) or a boolean array.
> Syntax: [starting_index:ending_index(included):step/traversal method]

In [33]:
# Get specified rows and columns
sales_df.loc[0:2, ["Product Name", "Total Revenue"]]

  Product Name  Total Revenue
0            A             30
1            B             40
2            C             50

## **Conditional Filtering**

In [34]:
# Get rows that have Total Revenue greater than 40
sales_df[sales_df['Total Revenue'] >= 40]

  Product Name  Quantity Sold  Sale Price  Total Revenue
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60

In [35]:
sales_df[sales_df['Product Name'] == 'A']

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
3            A              4          15             60
5            A              2          15             30

## **Apply**

The apply function in pandas is a powerful tool for working with DataFrames. 
It allows you to apply a custom function to each element (row or column) of the DataFrame 
and return a new DataFrame or Series based on the results.

In [36]:
sales_df

  Product Name  Quantity Sold  Sale Price  Total Revenue
0            A              3          10             30
1            B              2          20             40
2            C              5          10             50
3            A              4          15             60
4            B              1          20             20
5            A              2          15             30

In [37]:
def discount(original_price):
    discount_rate = 0.10
    discount_amount = original_price * discount_rate
    discounted_price = original_price - discount_amount
    return discounted_price


sales_df['10% Discounted Price'] = sales_df["Sale Price"].apply(discount)
sales_df

  Product Name  Quantity Sold  Sale Price  Total Revenue  10% Discounted Price
0            A              3          10             30                   9.0
1            B              2          20             40                  18.0
2            C              5          10             50                   9.0
3            A              4          15             60                  13.5
4            B              1          20             20                  18.0
5            A              2          15             30                  13.5

## Pandas Operators

Data Loading and Exploration:

- head(): Shows the first few rows of a DataFrame
- tail(): Shows the last few rows of a DataFrame
- describe(): Generates summary statistics for each column (mean, standard deviation, etc.)
- info(): Displays information about the DataFrame, including data types and memory usage

Data Analysis:

- sum(): Calculates the sum of a Series or DataFrame
- mean(): Calculates the mean of a Series or DataFrame
- median(): Calculates the median of a Series or DataFrame
- std(): Calculates the standard deviation of a Series or DataFrame
- var(): Calculates the variance of a Series or DataFrame

In [38]:
reviews_data = {
    'ProductID': ['P1', 'P2', 'P3', 'P4', 'P5', 'P6', 'P7', 'P8', 'P9', 'P10'],
    'Rating': [5, 3, 2, 3, 4, 5, 2, 4, 3, 1]
}

reviews_df = pd.DataFrame(reviews_data)
reviews_df

  ProductID  Rating
0        P1       5
1        P2       3
2        P3       2
3        P4       3
4        P5       4
5        P6       5
6        P7       2
7        P8       4
8        P9       3
9       P10       1

In [39]:
# head(num_row)
reviews_df.head()
reviews_df.head(3)

  ProductID  Rating
0        P1       5
1        P2       3
2        P3       2

In [40]:
# tail(num_row)
reviews_df.tail()
reviews_df.tail(3)

  ProductID  Rating
7        P8       4
8        P9       3
9       P10       1

In [41]:
reviews_df.describe()

          Rating
count  10.000000
mean    3.200000
std     1.316561
min     1.000000
25%     2.250000
50%     3.000000
75%     4.000000
max     5.000000

In [42]:
reviews_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ProductID  10 non-null     object
 1   Rating     10 non-null     int64
dtypes: int64(1), object(1)
memory usage: 292.0+ bytes

In [43]:
print("Sum of Rating Column:", reviews_df["Rating"].sum())

Sum of Rating Column: 32

In [44]:
print("Mean/Average of Rating Column:", reviews_df["Rating"].mean())

Mean/Average of Rating Column: 3.2

In [45]:
print("Mean of Rating Column:", reviews_df["Rating"].median())

Mean of Rating Column: 3.0

In [46]:
print("Standard Deviation of Rating Column:", reviews_df["Rating"].std())

Standard Deviation of Rating Column: 1.3165611772087666

In [47]:
print("Variance of Rating Column:", reviews_df["Rating"].var())

Variance of Rating Column: 1.7333333333333334

### **Importing and Exporting Data**

Pandas supports reading from and writing to a variety of file formats, 
including CSV, Excel, SQL, making it easy to integrate with data analysis workflows.

In [48]:
data = pd.read_csv('example.csv')
data

          A    B     C
0  1.000000  5.0  10.0
1  2.000000  6.5  11.0
2  2.333333  6.5  12.0
3  4.000000  8.0  11.0

In [49]:
# This lets us export to excel
%pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   - -------------------------------------- 10.2/250.9 kB ? eta -:--:--
   ----------- --------------------------- 71.7/250.9 kB 975.2 kB/s eta 0:00:01
   ------------------------ --------------- 153.6/250.9 kB 1.3 MB/s eta 0:00:01
   ----------------------------------- ---- 225.3/250.9 kB 1.5 MB/s eta 0:00:01
   ---------------------------------------- 250.9/250.9 kB 1.3 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [50]:
data.to_excel('exported_example_data.xlsx', sheet_name="Example Sheet", index=False)

In [51]:
data.to_csv('exported_example_data.csv', index=False)